Benchmark_tests/experiment1/concurrent_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.244.204.124 (be patient)


Server Software:        gunicorn/19.9.0
Server Hostname:        35.244.204.124
Server Port:            80

Document Path:          /
Document Length:        688 bytes

Concurrency Level:      100
Time taken for tests:   51.635 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      10570000 bytes
HTML transferred:       6880000 bytes
Requests per second:    193.67 [#/sec] (mean)
Time per request:       516.355 [ms] (mean)
Time per request:       5.164 [ms] (mean, across all concurrent requests)
Transfer rate:          199.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       53   88  48.4     81    1095
Processing:   315  409 158.1    374    3750
Waiting:      314  408 158.1    373    3750
Total:        383  497 168.9    459    3829

Percentage of the requests served within a certain time (ms)
  50%    459
  66%    484
  75%    505
  80%    521
  90%    580
  95%    650
  98%    859
  99%   1169
 100%   3829 (longest request)